#include <stdio.h>               
#include <string.h>                        // 문자열 처리함수를 위한 헤더파일
 
int main()
{
    char board[9][28] = {
        "...........................", 
        "....o.....................9", 
        "............o..............", 
        "...........................", 
        "....o......................",     // 배열의 선언과 초기화
        "...............o...........", 
        "...........................", 
        "......o..............o.....", 
        "..o.......o................"
    };

    int i = 0;
    while (board[0][i])
    {
        i++;
    }
    printf("%d\n", i);

    int k;
    int j = 0;
    while (board[j][0] == '.' || board[j][0] == 'o')
    {
        k = 0;
        while (board[j][k] == '.' || board[j][k] == 'o')
        {
            printf("%c", board[j][k]);
            k++;
        }
        printf("\n");
        if (k != i)
            printf("%d\n", k);
        j++;
    }
    return 0;
}